app/controllers/api/questions_controller.rb

  def index
    @questions = Question.includes(:answers)
---
SELECT "questions".* FROM "questions"

  def create
    question = Question.new(question_params)
    question.user_id = current_user.id
    question.username = current_user.username

    question.body = '' unless question.body
    if question.save!
---
INSERT INTO "questions" ("user_id", "title", "body", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["title", "Is this working?"], ["body", "idk"], ["username", "Wim"], ["created_at", "2016-01-29 14:05:27.897243"], ["updated_at", "2016-01-29 14:05:27.897243"]]
INSERT INTO "users" ("username", "password_digest", "description", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"