app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "description", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    # @user = User.includes(:username, :description, :questions).find(params[:id])
    user = User.find(params[:id])